blog/2016-05-22-我的运维之路-学习大纲.org
#+TITLE: 我的运维之路-学习大纲
#+DATE: 2016-05-22
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: Linux
#+JEKYLL_TAGS: 
#+JEKYLL_PUBLISHED: true

- Linux系统管理
- httpd, lamp, lnmp
- Cache: memcached, varnish
- LB Cluster: Nginx, LVS, haproxy
- HA Cluster: Keepalived, Corosync+pacemaker, pcs/crmsh
- Linux Ops:anisble, puppet, saltstack, cobbler
- Monitering:zabbix
- shell脚本编程
- tomcat, lnmt, lamt, session replication cluster
- 分布式：MogileFS, GlusterFS, zookeeper
- MySQL: HA Cluster, MHA, 备份和恢复, MySQL Replcation, Read-Write splitting
- NoSQL: redis, mongodb, HBase
- 虚拟化: kvm, SDN, Openstack, xen
- Docker: 容器云
- ELK Stack: ElasticSearch, Logstash, Kibana
- 大数据: Hadoop v2, HBase, Hive, Storm, Spark
- 系统优化
- Python编程
- DevOps: Development Operations
