_posts/2016-05-22-我的运维之路-学习大纲.html
---
title: "我的运维之路-学习大纲"
date: 2016-05-22
layout: post
categories: 
- Linux
tags: 
published: true
comments: 
---
<ul class="org-ul">
<li>Linux系统管理</li>
<li>httpd, lamp, lnmp</li>
<li>Cache: memcached, varnish</li>
<li>LB Cluster: Nginx, LVS, haproxy</li>
<li>HA Cluster: Keepalived, Corosync+pacemaker, pcs/crmsh</li>
<li>Linux Ops:anisble, puppet, saltstack, cobbler</li>
<li>Monitering:zabbix</li>
<li>shell脚本编程</li>
<li>tomcat, lnmt, lamt, session replication cluster</li>
<li>分布式：MogileFS, GlusterFS, zookeeper</li>
<li>MySQL: HA Cluster, MHA, 备份和恢复, MySQL Replcation, Read-Write splitting</li>
<li>NoSQL: redis, mongodb, HBase</li>
<li>虚拟化: kvm, SDN, Openstack, xen</li>
<li>Docker: 容器云</li>
<li>ELK Stack: ElasticSearch, Logstash, Kibana</li>
<li>大数据: Hadoop v2, HBase, Hive, Storm, Spark</li>
<li>系统优化</li>
<li>Python编程</li>
<li>DevOps: Development Operations</li>
</ul>
